<?
#-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-#
# CMS Eresus™
# © 2005, ProCreat Systems
# Web: http://procreat.ru
#-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-#

#-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-#
class THtml extends TContentPlugin {
  var
    $name = 'html',
    $type = 'user,content,ondemand',
    $title = 'HTML',
    $version = '0.01a',
    $description = 'HTML страница';
  #--------------------------------------------------------------------------------------------------------------------------------------------------------------#
  # Внутренние функции
  #--------------------------------------------------------------------------------------------------------------------------------------------------------------#
  function update()
  {
  global $db, $page, $request;

    $item = $db->selectItem('pages', "`id`='".$request['arg']['update']."'");
    $item['content'] = $request['arg']['content'];
    $db->updateItem('pages', $item, "`id`='".$request['arg']['update']."'");
    goto($page->url());
  }
  #--------------------------------------------------------------------------------------------------------------------------------------------------------------#
  # Административные функции
  #--------------------------------------------------------------------------------------------------------------------------------------------------------------#
  function contentEditor()
  {
  global $db, $page, $request;

    if (isset($request['arg']['update'])) $this->update();
    else {
      $item = $db->selectItem('pages', "`id`='".$request['arg']['section']."'");
      $form = array(
        'name' => 'contentEditor',
        'caption' => 'Текст страницы',
        'width' => '99%',
        'fields' => array (
          array ('type' => 'hidden','name' => 'update', 'value'=>$item['id']),
          array ('type' => 'html','name' => 'content','height' => '400px', 'value'=>StripSlashes($item['content']))
        ),
        'buttons'=> array('ok', 'reset'),
      );
      $result = $page->renderForm($form);
    }
    return $result;
  }
  #--------------------------------------------------------------------------------------------------------------------------------------------------------------#
}
#-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-#
$GLOBALS['plugins']->items['html'] = new THtml;
?>